---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ElementId
source: html/b9832e6f-4498-26a5-5392-3a365dec8702.htm
---
# ElementId Members

Create an ElementId handle with the given 32-bit integer id.